### Missing Data

In [3]:
import pandas as pd
import numpy as np
df = pd.DataFrame([[ 1.1, np.nan, np.nan, 10.3], [ 0.8, np.nan, 3.6, 2.9],[ 1.2, 2.5, 1.6, 2.7],[np.nan, np.nan, np.nan, np.nan], [np.nan, np.nan, 3.6, 5.3]], columns=list('ABCD'))
df

     A    B    C     D
0  1.1  NaN  NaN  10.3
1  0.8  NaN  3.6   2.9
2  1.2  2.5  1.6   2.7
3  NaN  NaN  NaN   NaN
4  NaN  NaN  3.6   5.3

In [4]:
df.dropna()

     A    B    C    D
2  1.2  2.5  1.6  2.7

In [5]:
df.dropna(how='all')

     A    B    C     D
0  1.1  NaN  NaN  10.3
1  0.8  NaN  3.6   2.9
2  1.2  2.5  1.6   2.7
4  NaN  NaN  3.6   5.3

In [8]:
df.dropna(thresh=3, axis=1)

     A    C     D
0  1.1  NaN  10.3
1  0.8  3.6   2.9
2  1.2  1.6   2.7
3  NaN  NaN   NaN
4  NaN  3.6   5.3

In [14]:
print(df)
df.dropna(thresh=3, axis=0)

     A    B    C     D
0  1.1  NaN  NaN  10.3
1  0.8  NaN  3.6   2.9
2  1.2  2.5  1.6   2.7
3  NaN  NaN  NaN   NaN
4  NaN  NaN  3.6   5.3

     A    B    C    D
1  0.8  NaN  3.6  2.9
2  1.2  2.5  1.6  2.7

In [15]:
df.fillna(3.6)

     A    B    C     D
0  1.1  3.6  3.6  10.3
1  0.8  3.6  3.6   2.9
2  1.2  2.5  1.6   2.7
3  3.6  3.6  3.6   3.6
4  3.6  3.6  3.6   5.3

In [16]:
df

     A    B    C     D
0  1.1  NaN  NaN  10.3
1  0.8  NaN  3.6   2.9
2  1.2  2.5  1.6   2.7
3  NaN  NaN  NaN   NaN
4  NaN  NaN  3.6   5.3

In [17]:
df.fillna({'A': df['A'].mean(), 'B': df['B'].mean(), 'C':df['C'].mean(), 'D': df['D'].mean()})

          A    B         C     D
0  1.100000  2.5  2.933333  10.3
1  0.800000  2.5  3.600000   2.9
2  1.200000  2.5  1.600000   2.7
3  1.033333  2.5  2.933333   5.3
4  1.033333  2.5  3.600000   5.3

In [18]:
df.fillna({'A': df['A'].mean(), 'B': df['B'].mean()}).fillna(0.000)

          A    B    C     D
0  1.100000  2.5  0.0  10.3
1  0.800000  2.5  3.6   2.9
2  1.200000  2.5  1.6   2.7
3  1.033333  2.5  0.0   0.0
4  1.033333  2.5  3.6   5.3

In [19]:
ser = pd.Series([1.2, 3.5, -99, -99, 4.0, -99, -0.5])
ser

0     1.2
1     3.5
2   -99.0
3   -99.0
4     4.0
5   -99.0
6    -0.5
dtype: float64

In [20]:
ser.replace({-99: 0, -0.5: np.nan})

0    1.2
1    3.5
2    0.0
3    0.0
4    4.0
5    0.0
6    NaN
dtype: float64

In [22]:
df = pd.DataFrame([['Lithium', 'Li', 3, 6, 0.0759], ['Lithium', 'Li', 3, 7, 0.9241], ['Sodium', 'Na', 11, 23, 1], ['Potassium', 'K', 19, 39, 0.932581], ['Potassium', 'K', 19, 40, 1.17e-4],['Potassium', 'K', 19, 41, 0.067302]], columns=['Element', 'Symbol', 'Z', 'A', 'Abundance'])
df

     Element Symbol   Z   A  Abundance
0    Lithium     Li   3   6   0.075900
1    Lithium     Li   3   7   0.924100
2     Sodium     Na  11  23   1.000000
3  Potassium      K  19  39   0.932581
4  Potassium      K  19  40   0.000117
5  Potassium      K  19  41   0.067302

In [23]:
df.drop_duplicates('Symbol')

     Element Symbol   Z   A  Abundance
0    Lithium     Li   3   6   0.075900
2     Sodium     Na  11  23   1.000000
3  Potassium      K  19  39   0.932581

In [24]:
df.drop_duplicates('Z')

     Element Symbol   Z   A  Abundance
0    Lithium     Li   3   6   0.075900
2     Sodium     Na  11  23   1.000000
3  Potassium      K  19  39   0.932581

In [25]:
df.drop_duplicates(['Z', 'A'], keep='last')

     Element Symbol   Z   A  Abundance
0    Lithium     Li   3   6   0.075900
1    Lithium     Li   3   7   0.924100
2     Sodium     Na  11  23   1.000000
3  Potassium      K  19  39   0.932581
4  Potassium      K  19  40   0.000117
5  Potassium      K  19  41   0.067302

In [31]:
marks = [67, 81, 34, 55, 77, 66, 59, 52, 70, 67, 58, 63, 49, 72]
bins = [0, 40, 60, 70, 80, 100]
dist = pd.cut(marks , bins)
dist

[(60, 70], (80, 100], (0, 40], (40, 60], (70, 80], ..., (60, 70], (40, 60], (60, 70], (40, 60], (70, 80]]
Length: 14
Categories (5, interval[int64, right]): [(0, 40] < (40, 60] < (60, 70] < (70, 80] < (80, 100]]

In [29]:
pd.value_counts(dist)

(40, 60]     5
(60, 70]     5
(70, 80]     3
(0, 40]      1
(80, 100]    0
dtype: int64

In [32]:
pd.value_counts(pd.cut(marks , bins , right=False))

[40, 60)     5
[60, 70)     4
[70, 80)     3
[0, 40)      1
[80, 100)    1
dtype: int64

In [35]:
dist = pd.cut(marks, bins, labels=list(reversed('ABCDE')), right=False)
dist

['C', 'A', 'E', 'D', 'B', ..., 'C', 'D', 'C', 'D', 'B']
Length: 14
Categories (5, object): ['E' < 'D' < 'C' < 'B' < 'A']

In [36]:
pd.value_counts(dist).sort_index(ascending=False)

A    1
B    3
C    4
D    5
E    1
dtype: int64